** DONE Home page and reload
   CLOSED: [2025-06-16 Mon 08:55]
   :LOGBOOK:
   - State "DONE"       from "DONE"       [2025-06-16 Mon 08:55]
   - State "DONE"       from "WORKING"    [2025-06-16 Mon 08:55]
   CLOCK: [2025-06-16 Mon 07:14]--[2025-06-16 Mon 08:55] =>  1:41
   - State "WORKING"    from "TODO"       [2025-06-16 Mon 07:15]
   :END:

- [X] Add home.html template
- [X] Add ring server handler, homepage view
- [X] Make sure code reload is working fine
- [X] Use bulma.css from CDN

** DONE Fake login
   CLOSED: [2025-07-04 Fri 23:45]
   :LOGBOOK:
   - State "DONE"       from "WORKING"    [2025-07-04 Fri 23:45]
   CLOCK: [2025-06-29 Sun 14:19]--[2025-06-29 Sun 14:39] =>  0:20
   CLOCK: [2025-06-29 Sun 11:22]--[2025-06-29 Sun 11:49] =>  0:27
   CLOCK: [2025-06-28 Sat 12:34]--[2025-06-28 Sat 13:29] =>  0:55
   - State "WORKING"    from "DONE"       [2025-06-28 Sat 12:35]
   - State "DONE"       from "TODO"       [2025-06-27 Fri 09:05]
   - State "TODO"       from              [2025-06-23 Mon 03:55]
   :END:

I need fake login to quickly login several users for testing purposes on localhost.

 - [X] redirect from ~home~ to /app when user is logged in
 - [X] logout (remove all data from session)
 - [X] make 'fake login' page show previous users to choose
   - [X] fix fake login->login
   - [X] use datastar to fill random values instead of js
   - [X] add user when actually making login
   - [X] make separate page for fake login functionality

** DONE Make sure meetings are displayed for today
   CLOSED: [2025-08-13 Wed 08:30]
   :LOGBOOK:
   - State "DONE"       from "REJECTED"   [2025-08-13 Wed 08:30]
   - State "REJECTED"   from "DONE"       [2025-08-13 Wed 08:30]
   - State "DONE"       from "TODO"       [2025-08-13 Wed 08:30]
   CLOCK: [2025-08-13 Wed 08:29]--[2025-08-13 Wed 08:29] =>  0:00
   - State "TODO"       from              [2025-08-11 Mon 19:40]
   :END:

... No such problem as we display all 'active' meetings!

** DONE Prepare for meeting of [2025-08-29 Fri]
   CLOSED: [2025-08-29 Fri 11:55]
   :LOGBOOK:
   - State "DONE"       from "WORKING"    [2025-08-29 Fri 11:55]
   CLOCK: [2025-08-29 Fri 08:24]--[2025-08-29 Fri 11:54] =>  3:30
   CLOCK: [2025-08-29 Fri 08:02]--[2025-08-29 Fri 08:09] =>  0:07
   - State "WORKING"    from              [2025-08-29 Fri 08:00]
   :END:

 - [ ] +Join meeting - to be href!+ its a POST action, it can't be GET
 - [X] link to join meeting in recent meetings (join button)
 - [X] Fix issue with discussion notes
 - [X] why "past meetings" is not active ? We have 2 past meetings
 - [X] forbid access to finished meeting
 - [X] for the finished meeting, disable the topics swithing, adding actions, etc or think how to
 - [X] click on recent meetings should display
 - [X] Display discussion notes on past meetings/my actions
 - [ ] edit topic?
 - [ ] +negative action?+
 - [X] my actions - for me or for team?
 - [ ] problem with topic text
 - [X] topic description on join meeting

** TODO Finish playwright tests for the meeting screen
   :LOGBOOK:
   CLOCK: [2025-08-13 Wed 08:35]--[2025-08-13 Wed 09:00] =>  0:25
   - State "TODO"       from              [2025-08-11 Mon 19:40]
   :END:

** DONE To finish before 1st deploy
   CLOSED: [2025-08-16 Sat 13:00]
   :LOGBOOK:
   - State "DONE"       from "TODO"       [2025-08-16 Sat 13:00]
   - State "TODO"       from "DONE"       [2025-08-16 Sat 13:00]
   - State "DONE"       from "TODO"       [2025-08-16 Sat 13:00]
   CLOCK: [2025-07-26 Sat 17:02]--[2025-07-26 Sat 17:02] =>  0:00
   - State "TODO"       from              [2025-07-26 Sat 12:05]
   :END:

*** DONE [#A] [Start meeting] button
    CLOSED: [2025-07-27 Sun 06:45]
    :LOGBOOK:
    - State "DONE"       from "WORKING"    [2025-07-27 Sun 06:45]
    CLOCK: [2025-07-27 Sun 06:46]--[2025-07-27 Sun 06:47] =>  0:01
    CLOCK: [2025-07-26 Sat 13:10]--[2025-07-26 Sat 13:13] =>  0:03
    - State "WORKING"    from "TODO"       [2025-07-26 Sat 13:10]
    - State "TODO"       from              [2025-07-26 Sat 12:05]
    :END:

- [X] Do not set status 'started' on 1st participant
- [X] Add button '[Start meeting'] on meeting screen, available only to staff users
- [X] Disallow switching topics when meeting is not started yet

*** DONE [#A] my actions completion & notes button
    CLOSED: [2025-07-27 Sun 17:40]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2025-07-27 Sun 17:40]
    CLOCK: [2025-07-27 Sun 13:48]--[2025-07-27 Sun 17:38] =>  3:50
    - State "TODO"       from              [2025-07-26 Sat 22:55]
    :END:
** WORKING [#B] Small bug fixes [2/2]
   :LOGBOOK:
   CLOCK: [2025-07-26 Sat 17:02]--[2025-07-26 Sat 22:45] =>  5:43
   - State "WORKING"    from "TODO"       [2025-07-26 Sat 13:15]
   CLOCK: [2025-07-26 Sat 13:13]--[2025-07-26 Sat 17:02] =>  3:49
   - State "TODO"       from "TODO"       [2025-07-26 Sat 12:15]
   - State "TODO"       from              [2025-07-26 Sat 12:15]
   :END:

- [X] forbid creation of a meetings in the past
- [X] hide action creation form after submit
- [ ] Profile - settings absent
- [ ] Project settings - shows some dialog, but nothing works.
- [ ] Past Meetings must work for finished meetings
- [ ] profile info to be displayed on meeting page (pass variable)

*** WORKING [#A] re-render the whole screen individually by signal - screen changed.
    :LOGBOOK:
    CLOCK: [2025-07-24 Thu 22:01]--[2025-07-24 Thu 22:21] =>  0:20
    - State "WORKING"    from "TODO"       [2025-07-24 Thu 21:35]
    - State "TODO"       from              [2025-07-24 Thu 21:15]
    :END:

*** DONE topics [100%]
    CLOSED: [2025-07-22 Tue 22:50]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2025-07-22 Tue 22:50]
    CLOCK: [2025-07-22 Tue 17:52]--[2025-07-22 Tue 22:48] =>  4:56
    - State "TODO"       from              [2025-07-21 Mon 22:10]
    :END:

- [X] Add topic
  - [X] clear input value after add!
- [X] Vote for topic
- [X] Delete topic (if it is not active or finished)
- [X] Set current topic (only for staff)
- [X] Meeting settings - votes are public
- [X] Make sure if voting is disabled, then we don't show the buttons and also backend checks

*** DONE config
    CLOSED: [2025-06-22 Sun 16:05]
    :LOGBOOK:
    - State "DONE"       from "WORKING"    [2025-06-22 Sun 16:05]
    CLOCK: [2025-06-21 Sat 08:37]--[2025-06-21 Sat 08:52] =>  0:15
    CLOCK: [2025-06-21 Sat 07:02]--[2025-06-21 Sat 07:13] =>  0:11
    CLOCK: [2025-06-20 Fri 08:10]--[2025-06-20 Fri 08:54] =>  0:44
    - State "WORKING"    from "TODO"       [2025-06-19 Thu 07:50]
    - State "TODO"       from              [2025-06-19 Thu 07:50]
    :END:
https://github.com/juxt/aero
*** DONE Implement "fake" login
    CLOSED: [2025-06-27 Fri 09:05]
    :LOGBOOK:
    - State "DONE"       from "TODO"       [2025-06-27 Fri 09:05]
    CLOCK: [2025-06-24 Tue 08:44]--[2025-06-24 Tue 08:44] =>  0:00
    - State "TODO"       from              [2025-06-24 Tue 08:10]
    :END:

- [X] Use random fake data (use some faker module)
- [X] Display button on dev-mode only
- [ ] implement 'post' action for fake login
  - 4xx for invalid (non-localhost) request

*** DONE Implement Sign In with Google / oauth2 std.
    CLOSED: [2025-06-27 Fri 09:10]
    :LOGBOOK:
    - State "DONE"       from "WORKING"    [2025-06-27 Fri 09:10]
    CLOCK: [2025-06-24 Tue 08:44]--[2025-06-24 Tue 10:09] =>  1:25
    CLOCK: [2025-06-22 Sun 16:07]--[2025-06-22 Sun 16:27] =>  0:20
    - State "WORKING"    from "TODO"       [2025-06-22 Sun 16:05]
    - State "TODO"       from              [2025-06-18 Wed 10:20]
    :END:

- [X] implement sign in with ~bulma~ button done:[2025-06-22 Sun 16:15]
- [X] change title from "Welcome to Bulma"

